#pragma once
#include <string_view>
#include "ArgumentInfo.h"
#include "Token.h"

namespace fuura
{
	//////////////////////////////////////////////////////////////////////////////
	//
	//	Предоставляет информацию об аргументах.
	//
	//////////////////////////////////////////////////////////////////////////////
	class IArgumentSet
	{
	public:
		// --------------------------------------------------------------------
		// Должна возвращать информацию об аргументе с именем name или генерировать
		// исключение типа "синтаксическая ошибка", если таковой отсутствует.
		// --------------------------------------------------------------------
		virtual ArgumentInfo GetArgumentInfo(std::string_view name, antlr4::Token* tokenInfo) = 0;
	};

	//////////////////////////////////////////////////////////////////////////////
}