#pragma once
#include <memory>
#include <string_view>
#include "ICalculatable.h"

namespace fuura
{
	///////////////////////////////////////////////////////////////////////////
	class IParser
	{
	public:
		virtual ~IParser() = default;

		// --------------------------------------------------------------------
		// Собственно, функция парсинга.
		// source - строка с кодом fuura, который требуется распарсить.
		// Возвращает готовый к выполнению объект.
		// Об ошибках в синтаксисе/семантике должен сообщать посредством исключений.
		// --------------------------------------------------------------------
		virtual std::unique_ptr<language::ICalculatable> Parse(std::string_view source) = 0;
	};

	///////////////////////////////////////////////////////////////////////////
}