#pragma once
#include "IExecutableMemoryManager.h"

namespace fuura::compilation::memory
{
	///////////////////////////////////////////////////////////////////////////////
	//
	//	Просто "насадка" на стандартный new, ничего не делает кроме того что
	//	делает память выполняемой. Версия только под Windows.
	//
	//	Даёт побочный эффект: вся динамическая память со страницы, на которой
	//	находится выделенный участок памяти, становится исполняемой.
	//	Не следит за фрагментацией.
	//
	//	С другой стороны, пока компилятор всё ещё в разработке, такого менеджера
	//	вполне достаточно.
	//
	///////////////////////////////////////////////////////////////////////////////
	class SimpleExecutableMemoryManager : IExecutableMemoryManager
	{
	public:
		virtual std::shared_ptr<void> PlaceToExecutableMemory(const void* shellCode, size_t codeSizeInBytes) override;
	};

	///////////////////////////////////////////////////////////////////////////////
}